#张量的索引




import torch

torch.manual_seed(24)
t1 = torch.randint(1,10,(3,4,5))
print(f't1:{t1}')


#基础索引
print(t1[0,:,:])
print(t1[:,0,:])
print(t1[:,:,0])

print(t1[[0,1],[3,3],[4,2]])#索引多个元素(0,3,4)和(1,3,2)

print(t1[0::2,0::2,0::2])#步长索引,每个维度都是奇数，第一个第三个第五个...

print(t1[0:1,0:2,2:3])#切片索引,从:左开始，从:右结束，左闭右开

#布尔索引
print(t1[t1>5])#布尔索引，返回大于5的元素
print(t1[:,t1[0,:,0]>6,:])#布尔索引

#布尔索引的本质是用条件生成一个只有True和False的张量滤码mask，然后用这个张量去过滤张量符合条件的数据
#比如mask = t1>5是一个全局滤网，t1[mask]会返回所有符合条件的元素
#t1[0,:,0]>5，根据t1一轴的数据个数，会返回一个长度为4的一维滤网
'''
t1:tensor([[[6, 9, 9, 2, 8],
         [7, 8, 5, 8, 4],
         [7, 4, 3, 9, 3],
         [6, 1, 4, 2, 8]],

        [[1, 2, 5, 7, 4],
         [3, 4, 6, 5, 8],
         [8, 8, 3, 4, 9],
         [6, 7, 2, 8, 8]],

        [[5, 6, 4, 2, 2],
         [2, 7, 9, 4, 2],
         [6, 3, 2, 3, 7],
         [5, 1, 7, 9, 2]]])
'''
#根据数据可知，滤网应该是[flase,true,true,flase]
#t1[:,mask,:]将滤网放在第一轴上
#那么最后会通过这个滤网将所有一轴等于一和二的元素筛出来

